// Keisanki Joron 2 (Introduction to Computing II)
// Dept. of Engineering Systems, University of Tsukuba
// [UTF-8 / Unix]
// 計算機序論２・実習 (筑波大学工学システム学類)

// 2012/11/05a kameda[at]iit.tsukuba.ac.jp
// 07.03. ファイル分割に伴う修正

#include "ic2-CommonHeaders.h"


// *********************************************************************** 
// Projection ************************************************************

// +++--------------------------------------------------
// カメラの投影行列を設定
// +++--------------------------------------------------

// +----------------------------------------------------
// 直交投影
// +----------------------------------------------------
void ic2_SetUpCamera_Ortho (void) {
  // OpenGLのPROJECTION行列スタックにアクセス
  glMatrixMode(GL_PROJECTION);

  // PROJECTION行列スタックトップを単位行列で初期化
  glLoadIdentity(); 

  // 直交投影行列を生成するサポート関数 glOrtho を呼び出す
  // glOrtho(左端, 右端, 下端, 上端, 近接側クリッピング面,  遠方側クリッピング面)
  glOrtho(-1.0, 1.0, -1.0, 1.0, -1.0, 1.0); // 
}

